# Variable Stars

This notebook demonstrates access the VariableStars database in the Azure cloud and loading some data into a Pandas DataFrame.

The example uses SQLAlchemy, a Python package for working with relational database management systems (DBMS). The actual connection is done via ODBC (Open DataBase Connectivity). ODBC provides a DBMS-independent API. Here the PyODBC package is used.

In [1]:
from sqlalchemy import create_engine
import pyodbc
import pandas as pd

# Create an "engine" for accessing the DBMS using an appropriate connection string.
engine = create_engine("mssql+pyodbc://student:2frenchfry!@VariableStars")
connection = engine.connect()

# Now use a Pandas read_sql call to issue an SQL query to the DBMS and retrieve the resuls as a DataFrame.
orion = pd.read_sql("SELECT * FROM star WHERE const = 'Ori'", connection)
orion

,name,const,ra,dec,max_bright,min_bright,kind,var_period,notes
0,AA,Ori,5.586181,-5.775889,13.8,15.9,INSB,0.000,None
1,AB,Ori,5.587289,-5.721528,13.8,16.5,INST,0.000,None
2,AC,Ori,5.587781,-5.398028,12.5,15.0,IN,0.000,None
3,AD,Ori,5.588142,-5.376611,12.9,15.0,INS,0.000,None
4,AG,Ori,5.589353,-5.579722,13.4,16.8,INST,0.000,None
...,...,...,...,...,...,...,...,...,...
2192,XY,Ori,5.578100,-5.769833,14.8,18.0,INS,0.000,None
2193,XZ,Ori,5.579225,-5.179889,14.8,17.0,INS:,0.000,None
2194,YY,Ori,5.579872,-5.965750,13.2,15.7,INST(YY),0.000,None
2195,YZ,Ori,5.581400,-5.057694,13.9,16.6,INST,0.000,None
2196,Z,Ori,5.930814,13.695000,9.8,10.7,EA/DS,5.203,None

We can use SQL to select various subsets of the data stored in the DBMS. This is useful because a typical DBMS manages vast amounts of data, and don't want to retrieve it all if we don't need it all (think about the load on the DBMS and the network bandwidth consumed). Pandas allows us to select subsets of the data in a DataFrame also, but that can be thought of as a "second layer" of selection used during whatever computation we are trying to do. Think of the DBMS as the storehouse of data, and Pandas as an active scratch pad or workspace where you are computing on the data.

In [4]:
# If the SQL is long, you can break it up, of course.
# You can also "compute" the SQL using variables, perhaps read the user or otherwise calculated.
select_columns = "SELECT name, const, max_bright, min_bright FROM star"
select_condition = "WHERE min_bright <= 6.0 AND const = 'Cyg' AND min_bright - max_bright >= 0.5"

naked_eye = pd.read_sql(select_columns + ' ' + select_condition, connection)
naked_eye

    name const  max_bright  min_bright
0  P       Cyg        3.00        6.00
1  V1511   Cyg        2.65        3.31
2  V1906   Cyg        2.40        3.30
3  V1965   Cyg        3.70        6.00
4  V1968   Cyg        1.20        3.20
5  V1969   Cyg        0.70        2.00

Let's do some calculations on the Orion variables data. Let's convert the right ascension to degrees:

In [5]:
orion["raDEG"] = (orion["ra"] / 24.0) * 360.0
orion

,name,const,ra,dec,max_bright,min_bright,kind,var_period,notes,raDEG
0,AA,Ori,5.586181,-5.775889,13.8,15.9,INSB,0.000,None,83.792715
1,AB,Ori,5.587289,-5.721528,13.8,16.5,INST,0.000,None,83.809335
2,AC,Ori,5.587781,-5.398028,12.5,15.0,IN,0.000,None,83.816715
3,AD,Ori,5.588142,-5.376611,12.9,15.0,INS,0.000,None,83.822130
4,AG,Ori,5.589353,-5.579722,13.4,16.8,INST,0.000,None,83.840295
...,...,...,...,...,...,...,...,...,...,...
2192,XY,Ori,5.578100,-5.769833,14.8,18.0,INS,0.000,None,83.671500
2193,XZ,Ori,5.579225,-5.179889,14.8,17.0,INS:,0.000,None,83.688375
2194,YY,Ori,5.579872,-5.965750,13.2,15.7,INST(YY),0.000,None,83.698080
2195,YZ,Ori,5.581400,-5.057694,13.9,16.6,INST,0.000,None,83.721000
2196,Z,Ori,5.930814,13.695000,9.8,10.7,EA/DS,5.203,None,88.962210

Let's also calculate the difference between the maximum and minimum magnitudes and then select only those stars where that difference is greater than 2.0. This can also be accomplished in the original SQL, which would be an alternative way to go about it.

In [11]:
orion_wide = orion.loc[orion["min_bright"] - orion["max_bright"] >= 2, ["name", "const", "max_bright", "min_bright"]]
orion_wide

       name const  max_bright  min_bright
0     AA      Ori        13.8        15.9
1     AB      Ori        13.8        16.5
2     AC      Ori        12.5        15.0
3     AD      Ori        12.9        15.0
4     AG      Ori        13.4        16.8
...     ...   ...         ...         ...
2191  XX      Ori        14.2        17.1
2192  XY      Ori        14.8        18.0
2193  XZ      Ori        14.8        17.0
2194  YY      Ori        13.2        15.7
2195  YZ      Ori        13.9        16.6

[501 rows x 4 columns]

It is also possible to create DataFrames and then write them back to the DBMS (provided you have sufficient permission). Thus the workflow would be: query the DBMS for some data of interest, compute on that data, and then (optionally) write the results back to the DBMS for long term storage.

Don't forget to close the connection with the DBMS:

In [12]:
connection.close()